tutorials/basic/simpleFoam/3D/Array_Parallel_Cylinders_Square_Arrangement/Velocity_Z_Direction/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile {
  version     2.0;
  format      ascii;
  class       volVectorField;
  location    "0";
  object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField {
  //- Set patchGroups for constraint patches
#includeEtc "caseDicts/setConstraintTypes"

  inlet
  {
    type   fixedValue;
    value  uniform (0 0 0.01);
  }
  outlet
  {
    type         inletOutlet;
    inletValue   uniform (0 0 0);
  }
  sphere
  {
    type            noSlip;
  }
  "wall.*"
  {
    type            slip;
  }
}


// ************************************************************************* //
